zfkun/stm32_std_study/core/hardware/mpu6050.h
#ifndef __MPU6050_H__
#define __MPU6050_H__

#include "stm32f10x.h"

// #define MPU6050_I2C_HW								// 使用硬件I2C
#define MPU6050_COMPLEMENTARY_FILTER_ENABLE			// 启用互补滤波
// #define MPU6050_COMPLEMENTARY_FILTER_DYNAMIC_WEIGHT	// 启用互补滤波动态权重

const static float FILTER_WEIGHT = 0.001; 			// 互补滤波权重 (0 ~ 1, 取值尽可能小)

// 原始寄存器值转摄氏度的乘法系数
// 公式: 温度（摄氏度）=（带符号的 TEMP_OUT 寄存器值）/ 温度传感器灵敏度系数 + 温度传感器偏移量
//   - 温度传感器灵敏度系数: 340 (LSB/℃)
//   - 温度传感器偏移量: 36.53
// 所以, 转换为乘法的乘数 = 1 / 340 = 0.0029411764705882353
const static float TEMP_MUL_FACTOR = 0.002941f;

// 零飘补偿相关
const static float YAW_GY_OFFSET = -4.0f;		// 陀螺仪Y轴零漂补偿(需按raw的实际情况调整)
const static float YAW_GX_OFFSET = 0.0f;		// 陀螺仪X轴零漂补偿(需按raw的实际情况调整)
const static float YAW_GZ_FACTOR = 20.0f;
const static float YAW_GZ_OFFSET = 0.0f;

// 零点校正
const static float EULER_AY_OFFSET = 2;		// 加速度计y轴零点校准(需按pitchAcc的计算值实际情况调整)
const static float EULER_AX_OFFSET = 0;		// 加速度计x轴零点校准(需按rollAcc的计算值实际情况调整)

// 加速度量程比例因子
static float accelFactor = 0.0f;
// 角速度量程比例因子
static float gyroFactor = 0.0f;


// MPU6050 外部帧同步(FSYNC)引脚采样
typedef enum
{
	MPU6050_ExtSync_Disable = 0x00,	// 禁止外部同步
	MPU6050_ExtSync_Temp = 0x10,	// 温度传感器外部帧同步
	MPU6050_ExtSync_GyroX = 0x08,	// 陀螺仪X轴外部帧同步
	MPU6050_ExtSync_GyroY = 0x18,	// 陀螺仪Y轴外部帧同步
	MPU6050_ExtSync_GyroZ = 0x20,	// 陀螺仪Z轴外部帧同步
	MPU6050_ExtSync_AccX = 0x28,	// 加速度计X轴外部帧同步
	MPU6050_ExtSync_AccY = 0x30,	// 加速度计Y轴外部帧同步
	MPU6050_ExtSync_AccZ = 0x38	    // 加速度计Z轴外部帧同步
} MPU6050_ExtSync_TypeDef;
#define IS_MPU6050_EXTSYNC(EXTSYNC) (((EXTSYNC) == MPU6050_ExtSync_Disable) || \
	((EXTSYNC) == MPU6050_ExtSync_GyroX) || ((EXTSYNC) == MPU6050_ExtSync_GyroY) || ((EXTSYNC) == MPU6050_ExtSync_GyroZ) || \
	((EXTSYNC) == MPU6050_ExtSync_AccX) || ((EXTSYNC) == MPU6050_ExtSync_AccY) || ((EXTSYNC) == MPU6050_ExtSync_AccZ))

// MPU6050 数字低通滤波(DLPF)
//
// 配置关系表
//
// |	DLPF_CFG	|			加速度计			|						陀螺仪			       |
// |                |------------------------------|----------------------------------------------|
// |				|	带宽(Hz)	|	延迟(ms)	|	带宽(Hz)	|	延迟(ms)	|	频率(kHz)	|
// |----------------------------------------------------------------------------------------------|
// |	0x00		|		260	    |		0	   |	 256	   |	  0.98	   |	   8 	  |
// |	0x01		|		184	    |		2.0	   |	 188	   |	  1.9	   |	   1 	  |
// |	0x02		|		94	    |		3.0	   |	 98	   	   |	  2.8	   |	   1 	  |
// |	0x03		|		44	    |		4.9	   |	 42	   	   |	  4.8	   |	   1 	  |
// |	0x04		|		21	    |		8.5	   |	 20	   	   |	  8.3	   |	   1 	  |
// |	0x05		|		10	    |		13.8   |	 10	   	   |	  13.4	   |	   1 	  |
// |	0x06		|		5	    |		19.0   |	 5	   	   |	  18.6	   |	   1 	  |
// |	0x07		|		       预留	   		   |	          预留	   			|	    8 	   |
//
//
// !!!注意!!! 这个参数的选择, 直接决定了 陀螺仪采样率, 也就是决定了灵敏度
//            所以, 按使用场景要合理选择:
//                 - 平衡小车:
//                   需高灵敏度, 选择 DLPF_CFG = 0x00, SMPRT_DIV = 7 (即: 1kHz 采样率), 
//           否则就算用了 `互补滤波` 也很难稳定
//
// 关于采样率
//
// 公式:
//   采样率 = 陀螺仪频率 / (1 + 采样分频)
//     - 采样率: MPU6050数据的刷新频率
//     - 采样分频: 初始化配置的 SMPRT_DIV
//     - 陀螺仪频率: 初始化配置的 DLPF_CFG (即 Filter 参数) 决定了 陀螺仪频率 (需要参考下面的 `配置关系表`)
//
// 举例
//   初始化配置:
//     - DLPF_CFG = 0x00  (即: Filter = MPU6050_Filter_260Hz)
//     - SMPRT_DIV = 7    (即: SMPRT_DIV = 7)
//     则, 陀螺仪频率为 8kHz (根据 `上表` 可见)
//
//   带入公式:
//     采样率 = 8kHz / (1 + 7) = 8000Hz / 8 = 1kHz
//     即, 陀螺仪 1ms 刷新一次
//
//
typedef enum
{
	MPU6050_Filter_260Hz = 0x00,
	MPU6050_Filter_184Hz = 0x01,
	MPU6050_Filter_94Hz = 0x02,
	MPU6050_Filter_44Hz = 0x03,
	MPU6050_Filter_21Hz = 0x04,
	MPU6050_Filter_10Hz = 0x05,
	MPU6050_Filter_5Hz = 0x06
} MPU6050_Filter_TypeDef;
#define IS_MPU6050_FILTER(FILTER) (((FILTER) == MPU6050_Filter_260Hz) || ((FILTER) == MPU6050_Filter_184Hz) || \
	((FILTER) == MPU6050_Filter_94Hz) || ((FILTER) == MPU6050_Filter_44Hz) || ((FILTER) == MPU6050_Filter_21Hz) || \
	((FILTER) == MPU6050_Filter_10Hz) || ((FILTER) == MPU6050_Filter_5Hz))


// MPU6050 陀螺仪 - 满刻度范围
typedef enum
{
	MPU6050_GYRO_FullScale_250dps = 0x00,		// 陀螺满仪刻度范围 ±250°/s
	MPU6050_GYRO_FullScale_500dps = 0x08,		// 陀螺满仪刻度范围 ±500°/s
	MPU6050_GYRO_FullScale_1000dps = 0x10,		// 陀螺满仪刻度范围 ±1000°/s
	MPU6050_GYRO_FullScale_2000dps = 0x18,		// 陀螺满仪刻度范围 ±2000°/s
} MPU6050_GYRO_FullScale_TypeDef;
#define IS_MPU6050_GYRO_FULLSCALE(FULLSCALE) (((FULLSCALE) == MPU6050_GYRO_FullScale_250dps) || \
	((FULLSCALE) == MPU6050_GYRO_FullScale_500dps) || ((FULLSCALE) == MPU6050_GYRO_FullScale_1000dps) || \
	((FULLSCALE) == MPU6050_GYRO_FullScale_2000dps))

// MPU6050 陀螺仪 - 自检 (可并行)
#define MPU6050_GYRO_SELFTEST_X 		0x80	// 启用X轴陀螺仪自检
#define MPU6050_GYRO_SELFTEST_Y 		0x40	// 启用Y轴陀螺仪自检
#define MPU6050_GYRO_SELFTEST_Z 		0x20	// 启用Z轴陀螺仪自检
#define IS_MPU6050_GYRO_SELFTEST(GYRO_SELFTEST) (((GYRO_SELFTEST) & ~(MPU6050_GYRO_SELFTEST_X | \
    MPU6050_GYRO_SELFTEST_Y | MPU6050_GYRO_SELFTEST_Z)) == 0)


// MPU6050 加速度计 - 满刻度范围
typedef enum
{
	MPU6050_ACCEL_FullScale_2g = 0x00,			// 加速度计满刻度范围 ±2g
	MPU6050_ACCEL_FullScale_4g = 0x08,			// 加速度计满刻度范围 ±4g
	MPU6050_ACCEL_FullScale_8g = 0x10,			// 加速度计满刻度范围 ±8g
	MPU6050_ACCEL_FullScale_16g = 0x18,			// 加速度计满刻度范围 ±16g
} MPU6050_ACCEL_FULLSCALE_TypeDef;
#define IS_MPU6050_ACCEL_FULLSCALE(FULLSCALE) ((((FULLSCALE) == MPU6050_ACCEL_FullScale_2g) || \
	((FULLSCALE) == MPU6050_ACCEL_FullScale_4g) || ((FULLSCALE) == MPU6050_ACCEL_FullScale_8g) || \
	((FULLSCALE) == MPU6050_ACCEL_FullScale_16g))

// MPU6050 加速度计 - 自检 (可并行)
#define MPU6050_ACCEL_SELFTEST_Disable	0x00	// 禁用加速度计自检
#define MPU6050_ACCEL_SELFTEST_X		0x80	// 启用X轴加速度计自检
#define MPU6050_ACCEL_SELFTEST_Y		0x40	// 启用Y轴加速度计自检
#define MPU6050_ACCEL_SELFTEST_Z		0x20	// 启用Z轴加速度计自检
#define IS_MPU6050_ACCEL_SELFTEST(ACCEL_SELFTEST) (((ACCEL_SELFTEST) & ~(MPU6050_ACCEL_SELFTEST_X | \
    MPU6050_ACCEL_SELFTEST_Y | MPU6050_ACCEL_SELFTEST_Z | MPU6050_ACCEL_SELFTEST_Disable)) == 0)



// MPU6050 FIFO使能 (可并行)
#define MPU6050_FIFO_SLV0		0x01	// 从设备0 EXT_SENS_DATA 数据写入FIFO缓冲器
#define MPU6050_FIFO_SLV1		0x02	// 从设备1 EXT_SENS_DATA 数据写入FIFO缓冲器
#define MPU6050_FIFO_SLV2		0x04	// 从设备2 EXT_SENS_DATA 数据写入FIFO缓冲器
#define MPU6050_FIFO_ACCEL		0x08	// 加速度计XYZ轴 (H + L) 数据写入FIFO缓冲器
#define MPU6050_FIFO_ZG			0x10	// 陀螺仪Z轴 (H + L) 数据写入FIFO缓冲器
#define MPU6050_FIFO_YG			0x20	// 陀螺仪Y轴 (H + L) 数据写入FIFO缓冲器
#define MPU6050_FIFO_XG			0x40	// 陀螺仪X轴 (H + L) 数据写入FIFO缓冲器
#define MPU6050_FIFO_TEMP		0x80	// 温度数据 (H + L) 数据写入FIFO缓冲器
#define IS_MPU6050_FIFO(FIFO) (((FIFO) & ~(MPU6050_FIFO_SLV0 | \
    MPU6050_FIFO_SLV1 | MPU6050_FIFO_SLV2 | MPU6050_FIFO_ACCEL | \
    MPU6050_FIFO_ZG | MPU6050_FIFO_YG | MPU6050_FIFO_XG | MPU6050_FIFO_TEMP)) == 0)

// MPU6050 电源管理1 - 时钟源
// - 选择内部 8MHz 振荡器或外部时钟源时，可以在禁用陀螺仪的情况下以低功耗模式运行
// - 强烈建议将设备配置为使用其中一个陀螺仪（或外部时钟源）作为时钟基准，以提高稳定性
typedef enum
{
	MPU6050_PWR_MGMT1_Clock_IN_8MHz = 0x00,		// 内部 8MHz 振荡器 时钟源
	MPU6050_PWR_MGMT1_Clock_GX = 0x01,			// 陀螺仪X轴 时钟源
	MPU6050_PWR_MGMT1_Clock_GY = 0x02,			// 陀螺仪Y轴 时钟源
	MPU6050_PWR_MGMT1_Clock_GZ = 0x03,			// 陀螺仪Z轴 时钟源
	MPU6050_PWR_MGMT1_Clock_EXT_32kHz = 0x04,	// 外部 32.768kHz 振荡器 时钟源
	MPU6050_PWR_MGMT1_Clock_EXT_19MHz = 0x05,	// 外部 19.2MHz 振荡器 时钟源
	MPU6050_PWR_MGMT1_Clock_STOPPED = 0x07,		// 停止时钟, 使定时发生器处于复位状态
} MPU6050_PWR_MGMT1_Clock_TypeDef;
#define IS_MPU6050_PWR_MGMT1_CLOCK(CLOCK) (((CLOCK) == MPU6050_PWR_MGMT1_Clock_IN_8MHz) || \
	((CLOCK) == MPU6050_PWR_MGMT1_Clock_GX) || ((CLOCK) == MPU6050_PWR_MGMT1_Clock_GY) || \
	((CLOCK) == MPU6050_PWR_MGMT1_Clock_GZ) || ((CLOCK) == MPU6050_PWR_MGMT1_Clock_EXT_32kHz) || \
	((CLOCK) == MPU6050_PWR_MGMT1_Clock_EXT_19MHz))

// MPU6050 电源管理1 - 模式 (可并行)
// - 在禁用 SLEEP 的同时将 CYCLE 设置为1 时，将进入 睡眠/唤醒 的循环模式, 采集频率为 LP_Wake 的设定值
// - 启用复位会把所有内部寄存器重置为默认值。复位完成后，该位自动清零
#define MPU6050_PWR_MGMT1_MODE_TEMP_DISABLE		0x80		// 禁用温度传感器
#define MPU6050_PWR_MGMT1_MODE_CYCLE_ENABLE		0x20		// 启用循环模式 (禁用休眠才有效)
#define MPU6050_PWR_MGMT1_MODE_SLEEP_ENABLE		0x40		// 启用休眠模式
#define MPU6050_PWR_MGMT1_MODE_DEVICE_RESET		0x80		// 启用设备复位
#define IS_MPU6050_PWR_MGMT1_MODE(MODE) (((MODE) & ~(MPU6050_PWR_MGMT1_TEMP_DISABLE | \
    MPU6050_PWR_MGMT1_CYCLE_ENABLE | MPU6050_PWR_MGMT1_SLEEP_ENABLE | MPU6050_PWR_MGMT1_DEVICE_RESET)) == 0)

// MPU6050 电源管理2 - 模式 (可并行)
#define MPU6050_PWR_MGMT2_MODE_STBY_ZG			0x01		// 禁用Z轴陀螺仪
#define MPU6050_PWR_MGMT2_MODE_STBY_YG			0x02		// 禁用Y轴陀螺仪
#define MPU6050_PWR_MGMT2_MODE_STBY_XG			0x04		// 禁用X轴陀螺仪
#define MPU6050_PWR_MGMT2_MODE_STBY_ZA			0x08		// 禁用Z轴加速度计
#define MPU6050_PWR_MGMT2_MODE_STBY_YA			0x10		// 禁用Y轴加速度计
#define MPU6050_PWR_MGMT2_MODE_STBY_XA			0x20		// 禁用Z轴加速度计
#define IS_MPU6050_PWR_MGMT2_MODE(MODE) (((MODE) & ~(MPU6050_PWR_MGMT2_STBY_ZG | \
    MPU6050_PWR_MGMT2_STBY_YG | MPU6050_PWR_MGMT2_STBY_XG | MPU6050_PWR_MGMT2_STBY_ZA | \
    MPU6050_PWR_MGMT2_STBY_YA | MPU6050_PWR_MGMT2_STBY_XA))) == 0)

// MPU6050 电源管理2 - 唤醒频率 
// - 仅 加速计低功耗模式 下的唤醒频率
typedef enum
{
	MPU6050_PWR_MGMT2_LP_WAKE_1_25Hz = 0x00,	// 唤醒频率 1.25Hz (仅加速计低功耗模式下)
	MPU6050_PWR_MGMT2_LP_WAKE_5Hz = 0x40,		// 唤醒频率 5Hz (仅加速计低功耗模式下)
	MPU6050_PWR_MGMT2_LP_WAKE_20Hz = 0x80,		// 唤醒频率 20Hz (仅加速计低功耗模式下)
	MPU6050_PWR_MGMT2_LP_WAKE_40Hz = 0xC0,		// 唤醒频率 40Hz (仅加速计低功耗模式下)
} MPU6050_PWR_MGMT2_LP_Wake_TypeDef;
#define IS_MPU6050_PWR_MGMT2_LP_WAKE(LP_WAKE) (((LP_WAKE) == MPU6050_PWR_MGMT2_LP_WAKE_1_25Hz) || \
	((LP_WAKE) == MPU6050_PWR_MGMT2_LP_WAKE_5Hz) || ((LP_WAKE) == MPU6050_PWR_MGMT2_LP_WAKE_20Hz) || \
	(LP_WAKE) == MPU6050_PWR_MGMT2_LP_WAKE_40Hz)

//  MPU6050 初始化配置
typedef struct
{
	uint8_t SMPRT_DIV; 									// 采样率分频 (范围: 0 ~ 254)
	MPU6050_ExtSync_TypeDef ExtSync;					// 外部帧同步
	MPU6050_Filter_TypeDef Filter;						// 数字低通滤波

	MPU6050_GYRO_FullScale_TypeDef GYRO_FullScale;		// 陀螺仪满量程范围
	uint8_t GYRO_SelfTest;								// 陀螺仪自检

	MPU6050_ACCEL_FULLSCALE_TypeDef ACCEL_FullScale;	// 加速度计
	uint8_t ACCEL_SelfTest;

	uint8_t FIFO;										// FIFO

	uint8_t PWR1_Mode;
	MPU6050_PWR_MGMT1_Clock_TypeDef PWR1_Clock;			// 电源管理1 时钟源

	uint8_t PWR2_Mode;									// 电源管理2 模式
	MPU6050_PWR_MGMT2_LP_Wake_TypeDef PWR2_LP_Wake;		// 唤醒频率 (仅加速度计低功耗模式下)
} MPU6050_InitTypeDef;

// 原始传感器数据
typedef struct
{
	int16_t ax;		// 加速度计X轴 (原始数据)
	int16_t ay;		// 加速度计Y轴 (原始数据)
	int16_t az;		// 加速度计Z轴(原始数据)
    int16_t temp;	// 温度数据 (原始数据)
	int16_t gx;		// 陀螺仪X轴 (原始数据)
	int16_t gy;		// 陀螺仪Y轴 (原始数据)
	int16_t gz;		// 陀螺仪Z轴 (原始数据)
} MPU6050_RawData_t;

// 加速度计 测量数据 (已解算)
typedef struct
{
	float pitch;	// 俯仰角 (欧拉角) Y轴 (抬头/低头)
	float yaw;		// 偏航角 (欧拉角) Z轴 (左右旋转)
	float roll;		// 翻滚角 (欧拉角) X轴 (左右倾斜)
} MPU6050_AccelData_t;

// 欧拉角 数据 (已解算)
typedef struct
{
	float pitch;	// 俯仰角 (欧拉角) Y轴 (抬头/低头)
	float yaw;		// 偏航角 (欧拉角) Z轴 (左右旋转)
	float roll;		// 翻滚角 (欧拉角) X轴 (左右倾斜)
} MPU6050_EulerData_t;

// 完整数据
typedef struct
{
	float gyro_dt;				// 陀螺仪角速度积分采样时间间隔 (单位: s)

	MPU6050_RawData_t raw;		// 原始传感器数据
	MPU6050_AccelData_t accel;	// 加速度计测量数据
	MPU6050_EulerData_t euler;	// 欧拉角数据 (互补滤波, 已解算)
} MPU6050_Data_t;

void MPU6050_Init(void);
uint8_t MPU6050_GetID(void);
void MPU6050_GetRaw(MPU6050_Data_t *raw);
void MPU6050_GetEuler(MPU6050_Data_t *euler);
void MPU6050_GetData(MPU6050_Data_t *data);
int16_t MPU6050_GetTempture(void);

#endif
